VPro/src/Catalogs/WorkSchedules/WorkSchedules.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>WorkSchedules</name>
  <attributes>
    <name>DeleteScheduleType</name>
    <type>
      <types>EnumRef.WorkScheduleTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>WorkweekDuration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BeginnigDate</name>
    <comment>(Common)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Calendar</name>
    <type>
      <types>CatalogRef.Calendars</types>
    </type>
  </attributes>
  <attributes>
    <name>Color</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessCalendar</name>
    <type>
      <types>CatalogRef.BusinessCalendars</types>
    </type>
  </attributes>
  <attributes>
    <name>FillMethod</name>
    <type>
      <types>EnumRef.WorkScheduleFillingMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>UseSchedule</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountHolidays</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NotValid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Periods</name>
    <attributes>
      <name>DayNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BeginTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WorkSchedule</name>
    <attributes>
      <name>CycleDayNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BeginTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>WorkHoursQuantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TimeBreak</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DayIncludedInSchedule</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Active</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Breaks</name>
    <attributes>
      <name>DayNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BeginTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TemplateByYear</name>
    <attributes>
      <name>Year</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TemplateGraphFill</name>
      <type>
        <types>CatalogRef.WorkTimeGraphsTemplates</types>
      </type>
    </attributes>
    <attributes>
      <name>BeginnigDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ScheduleType</name>
      <type>
        <types>EnumRef.WorkScheduleTypes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalFillingSettings</name>
    <attributes>
      <name>SettingValue</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BeginTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>WorkHoursQuantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TimeBreak</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalFillingSettingsPeriods</name>
    <attributes>
      <name>SettingValue</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BeginTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BreakHours</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>GraphPeriods</name>
    <attributes>
      <name>CycleDayNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BeginTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndTime</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BreakHours</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/InformationRegisters/Employees/Employees.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Employees</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </resources>
  <resources>
    <name>Position</name>
    <type>
      <types>CatalogRef.Positions</types>
    </type>
  </resources>
  <resources>
    <name>OccupiedRates</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>WorkSchedule</name>
    <type>
      <types>CatalogRef.WorkSchedules</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

VPro/src/Catalogs/Employees/Employees.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Employees</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Ind</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>OccupationType</name>
    <type>
      <types>EnumRef.OccupationTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsHumanResourcesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>AdvanceHoldersGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>OverrunGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>NotValid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Catalogs/WorkSchedules/Forms/ChoiceForm/Module.bsl
&AtClient
Procedure ListOnActivateRow(Item)
	
	CurrentData = Items.List.CurrentData;
	
	If CurrentData = Undefined Then Return EndIf;
	
	
	CommonUseClientServer.SetFilterDynamicListItem(СущностиПоГрафику, 
	"WorkSchedule",
	CurrentData.Ref,
	DataCompositionComparisonType.Equal);
	
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	FilterField = New DataCompositionField("NotValid");
	
	НовыйОтбор = List.Filter.Items.Add(Type("DataCompositionFilterItem"));
	НовыйОтбор.Use = True;
	НовыйОтбор.LeftValue = FilterField;
	НовыйОтбор.RightValue = False;
	НовыйОтбор.ComparisonType = DataCompositionComparisonType.Equal;
	
	If Parameters.Property("Subsystem") Then
		ТипПодсистемы = Parameters.Subsystem;
	Else
		ТипПодсистемы = 0;
		Items.ГруппаСущностиПоГрафику.Visible = False;
		Items.ОтборПографику.Visible = False;
	EndIf;
	
	If ТипПодсистемы = 2 Then
		СущностиПоГрафику.QueryText =
		"SELECT DISTINCT
		|	StaffSliceLast.WorkSchedule AS WorkSchedule,
		|	StaffSliceLast.Employee AS EnterpriseResource
		|FROM
		|	InformationRegister.Employees.SliceLast(
		|			,
		|			NOT Employee.NotValid
		|				AND NOT WorkSchedule = VALUE(Catalog.WorkSchedules.EmptyRef)) AS StaffSliceLast
		|
		|ORDER BY
		|	StaffSliceLast.Employee.Description";
		
		Items.СписокСотрудникиПоГрафикуРесурсПредприятия.Title = NStr("en='Employees on graphics';vi='Nhân viên trên lịch';");
		Items.ОтборПографику.Visible = False;
		
	EndIf;
	
	SetConditionalAppearance();
	
EndProcedure

&AtServer
Procedure SetConditionalAppearance()

	NewConditionalAppearance = ConditionalAppearance.Items.Add();
	WorkWithForm.AddDataCompositionFilterItem(NewConditionalAppearance.Filter, "List.NotValid", True, DataCompositionComparisonType.Equal);
	WorkWithForm.AddConditionalAppearanceField(NewConditionalAppearance, "Description");
	WorkWithForm.AddConditionalAppearanceElement(NewConditionalAppearance, "TextColor", StyleColors.TabularSectionUnavailableTextColor);

EndProcedure

&AtClient
Procedure СписокСотрудникиПоГрафикуВыбор(Item, SelectedRow, Field, StandardProcessing)
	
	CurrentData = Items.СущностиПоГрафику.CurrentData;
	If CurrentData = Undefined Then Return EndIf;
	
	If TypeOf(CurrentData.EnterpriseResource) = Type("CatalogRef.KeyResources") Then
		FormParameters = New Structure("Key", CurrentData.EnterpriseResource);
		OpenForm("Catalog.KeyResources.ObjectForm",FormParameters);
	ElsIf TypeOf(CurrentData.EnterpriseResource) = Type("CatalogRef.Employees") Then
		FormParameters = New Structure("Key", CurrentData.EnterpriseResource);
		OpenForm("Catalog.Employees.ObjectForm",FormParameters);
	Else
		FormParameters = New Structure("Key", CurrentData.EnterpriseResource);
		OpenForm("Catalog.Teams.ObjectForm",FormParameters);
	EndIf;

EndProcedure

&AtClient
Procedure ShowInvalid(Command)
	
	FilterField = New DataCompositionField("NotValid");
	FoundItem = Undefined;
	
	For Each FilterItem In List.Filter.Items Do
		
		If TypeOf(FilterItem) = Type("DataCompositionFilterItemGroup")
			Then
			Continue;
		EndIf;
		
		If FilterItem.LeftValue = FilterField
			Then
			FoundItem = FilterItem;
			Break
		EndIf;
	EndDo;
	
	If FoundItem = Undefined
		Then
		Return;
	EndIf;
	
	НовыйОтбор = FoundItem;
	НовыйОтбор.Use = Not НовыйОтбор.Use;
	
EndProcedure

&AtClient
Procedure ОтборПографикуOnChange(Item)
	
	УстановитьОтборПоГрафику();
	
EndProcedure

&AtServer
Procedure УстановитьОтборПоГрафику()
	
	If ОтборПографику = "Employees" Then
		Items.СущностиПоГрафикуРесурсПредприятия.Title = NStr("en='Employees on graphics';vi='Nhân viên trên lịch'");
		SmallBusinessClientServer.SetListFilterItem(СущностиПоГрафику, "ТипРесурса", 1, True, DataCompositionComparisonType.Equal);
	ElsIf ОтборПографику = "Teams" Then
		Items.СущностиПоГрафикуРесурсПредприятия.Title = NStr("en='Teams on graphics';vi='Đội lao động trên lịch'");
		SmallBusinessClientServer.SetListFilterItem(СущностиПоГрафику, "ТипРесурса", 2, True, DataCompositionComparisonType.Equal);
	ElsIf ОтборПографику = "Resources" Then
		Items.СущностиПоГрафикуРесурсПредприятия.Title = NStr("en='Resources on graphics';vi='Tài nguyên trên lịch'");
		SmallBusinessClientServer.SetListFilterItem(СущностиПоГрафику, "ТипРесурса", 3, True, DataCompositionComparisonType.Equal);
	Else
		SmallBusinessClientServer.SetListFilterItem(СущностиПоГрафику, "ТипРесурса", 0, False, DataCompositionComparisonType.Equal);
		Items.СущностиПоГрафикуРесурсПредприятия.Title = NStr("en='All items on graphics';vi='Tất cả các mục trên lịch'");
	EndIf;
		
EndProcedure
